### 📦 Plan for `sbx/eu-west-1/infra-01/vpc`
```hcl
[0;90m03:37:02.370[0m [0;37mSTDOUT[0m [0;36mterraform: [0mAcquiring state lock. This may take a few moments...
[0;90m03:37:05.052[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m[1mmodule.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...[0m[0m[0m
[0;90m03:37:05.052[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m[1mmodule.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...[0m[0m[0m
[0;90m03:37:05.052[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m[1mdata.aws_availability_zones.available_azs: Reading...[0m[0m[0m
[0;90m03:37:05.054[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m[1mmodule.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347][0m[0m
[0;90m03:37:05.054[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m[1mmodule.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2053943846][0m[0m
[0;90m03:37:05.655[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m[1mdata.aws_availability_zones.available_azs: Read complete after 1s [id=eu-west-1][0m[0m
[0;90m03:37:05.916[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform used the selected providers to generate the following execution
[0;90m03:37:05.916[0m [0;37mSTDOUT[0m [0;36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[0;90m03:37:05.916[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  [32m+[0m create[0m[0m
[0;90m03:37:05.916[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m03:37:05.916[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # aws_eip.nat_gw_elastic_ip[0m will be created[0m
[0;90m03:37:05.916[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_eip" "nat_gw_elastic_ip" {[0m
[0;90m03:37:05.917[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m allocation_id        = (known after apply)[0m
[0;90m03:37:05.917[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                  = (known after apply)[0m
[0;90m03:37:05.917[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m association_id       = (known after apply)[0m
[0;90m03:37:05.917[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m carrier_ip           = (known after apply)[0m
[0;90m03:37:05.917[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m customer_owned_ip    = (known after apply)[0m
[0;90m03:37:05.917[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m domain               = "vpc"[0m
[0;90m03:37:05.917[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                   = (known after apply)[0m
[0;90m03:37:05.917[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m instance             = (known after apply)[0m
[0;90m03:37:05.917[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipam_pool_id         = (known after apply)[0m
[0;90m03:37:05.917[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m network_border_group = (known after apply)[0m
[0;90m03:37:05.917[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m network_interface    = (known after apply)[0m
[0;90m03:37:05.917[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m private_dns          = (known after apply)[0m
[0;90m03:37:05.917[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m private_ip           = (known after apply)[0m
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ptr_record           = (known after apply)[0m
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m public_dns           = (known after apply)[0m
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m public_ip            = (known after apply)[0m
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m public_ipv4_pool     = (known after apply)[0m
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                 = {[0m
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name" = "sbx-dev-eu-west-1-infra-01-nap-eip"[0m
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all             = {[0m
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                = "sbx-dev-eu-west-1-infra-01-nap-eip"[0m
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.918[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc                  = (known after apply)[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_cloudwatch_log_group.flow_log[0][0m will be created[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "flow_log" {[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn               = (known after apply)[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                = (known after apply)[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m log_group_class   = (known after apply)[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m name              = (known after apply)[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m name_prefix       = (known after apply)[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m retention_in_days = 0[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m skip_destroy      = false[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags              = {[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all          = {[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.919[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.920[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.920[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.920[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.920[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.920[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.920[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.920[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_db_subnet_group.database[0][0m will be created[0m
[0;90m03:37:05.920[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_db_subnet_group" "database" {[0m
[0;90m03:37:05.920[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                     = (known after apply)[0m
[0;90m03:37:05.920[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m description             = "Database subnet group for sbx-dev-eu-west-1-infra-01-vpc"[0m
[0;90m03:37:05.920[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                      = (known after apply)[0m
[0;90m03:37:05.920[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m name                    = "sbx-dev-eu-west-1-infra-01-vpc"[0m
[0;90m03:37:05.920[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m name_prefix             = (known after apply)[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m subnet_ids              = (known after apply)[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m supported_network_types = (known after apply)[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                    = {[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"        = "sbx-dev-eu-west-1-infra-01-vpc"[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all                = {[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                = "sbx-dev-eu-west-1-infra-01-vpc"[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                  = (known after apply)[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_default_network_acl.this[0][0m will be created[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_default_network_acl" "this" {[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                    = (known after apply)[0m
[0;90m03:37:05.921[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m default_network_acl_id = (known after apply)[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                     = (known after apply)[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id               = (known after apply)[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                   = {[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-default"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all               = {[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-default"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                 = (known after apply)[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m egress {[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m action          = "allow"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m from_port       = 0[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m ipv6_cidr_block = "::/0"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m protocol        = "-1"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m rule_no         = 101[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m to_port         = 0[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            [90m# (1 unchanged attribute hidden)[0m[0m[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m egress {[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m action          = "allow"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m cidr_block      = "0.0.0.0/0"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m from_port       = 0[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m protocol        = "-1"[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m rule_no         = 100[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m to_port         = 0[0m
[0;90m03:37:05.922[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            [90m# (1 unchanged attribute hidden)[0m[0m[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ingress {[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m action          = "allow"[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m from_port       = 0[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m ipv6_cidr_block = "::/0"[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m protocol        = "-1"[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m rule_no         = 101[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m to_port         = 0[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            [90m# (1 unchanged attribute hidden)[0m[0m[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ingress {[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m action          = "allow"[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m cidr_block      = "0.0.0.0/0"[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m from_port       = 0[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m protocol        = "-1"[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m rule_no         = 100[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m to_port         = 0[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            [90m# (1 unchanged attribute hidden)[0m[0m[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_default_route_table.default[0][0m will be created[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_default_route_table" "default" {[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                    = (known after apply)[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m default_route_table_id = (known after apply)[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                     = (known after apply)[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id               = (known after apply)[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route                  = (known after apply)[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                   = {[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-default"[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all               = {[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.923[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-default"[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                 = (known after apply)[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m timeouts {[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m create = "5m"[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m update = "5m"[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_default_security_group.this[0][0m will be created[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_default_security_group" "this" {[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                    = (known after apply)[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m description            = (known after apply)[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m egress                 = (known after apply)[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                     = (known after apply)[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ingress                = (known after apply)[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m name                   = (known after apply)[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m name_prefix            = (known after apply)[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id               = (known after apply)[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m revoke_rules_on_delete = false[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                   = {[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-default"[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all               = {[0m
[0;90m03:37:05.924[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-default"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                 = (known after apply)[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_flow_log.this[0][0m will be created[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_flow_log" "this" {[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                      = (known after apply)[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m iam_role_arn             = (known after apply)[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                       = (known after apply)[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m log_destination          = (known after apply)[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m log_destination_type     = "cloud-watch-logs"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m log_format               = (known after apply)[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m log_group_name           = (known after apply)[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m max_aggregation_interval = 60[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                     = {[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all                 = {[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.925[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m traffic_type             = "ALL"[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                   = (known after apply)[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0][0m will be created[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn              = (known after apply)[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m attachment_count = (known after apply)[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id               = (known after apply)[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m name             = (known after apply)[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m name_prefix      = "vpc-flow-log-to-cloudwatch-"[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m path             = "/"[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m policy           = jsonencode([0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              [32m+[0m[0m Statement = [[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  [32m+[0m[0m {[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m Action   = [[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m "logs:PutLogEvents",[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m "logs:DescribeLogStreams",[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m "logs:DescribeLogGroups",[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m "logs:CreateLogStream",[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        ]
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m Effect   = "Allow"[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m Resource = "*"[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m Sid      = "AWSVPCFlowLogsPushToCloudWatch"[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              [32m+[0m[0m Version   = "2012-10-17"[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m policy_id        = (known after apply)[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags             = {[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.926[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all         = {[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0][0m will be created[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_iam_role" "vpc_flow_log_cloudwatch" {[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                   = (known after apply)[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m assume_role_policy    = jsonencode([0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              [32m+[0m[0m Statement = [[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  [32m+[0m[0m {[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m Action    = "sts:AssumeRole"[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m Effect    = "Allow"[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m Principal = {[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          [32m+[0m[0m Service = "vpc-flow-logs.amazonaws.com"[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      [32m+[0m[0m Sid       = "AWSVPCFlowLogsAssumeRole"[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              [32m+[0m[0m Version   = "2012-10-17"[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m create_date           = (known after apply)[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m force_detach_policies = false[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                    = (known after apply)[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m managed_policy_arns   = (known after apply)[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m max_session_duration  = 3600[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m name                  = (known after apply)[0m
[0;90m03:37:05.927[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m name_prefix           = "vpc-flow-log-role-"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m path                  = "/"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                  = {[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all              = {[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m unique_id             = (known after apply)[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m inline_policy (known after apply)[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0][0m will be created[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id         = (known after apply)[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m policy_arn = (known after apply)[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m role       = (known after apply)[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_internet_gateway.this[0][0m will be created[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_internet_gateway" "this" {[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn      = (known after apply)[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id       = (known after apply)[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id = (known after apply)[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags     = {[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"        = "sbx-dev-eu-west-1-infra-01-vpc"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.928[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all = {[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                = "sbx-dev-eu-west-1-infra-01-vpc"[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id   = (known after apply)[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_nat_gateway.this[0][0m will be created[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_nat_gateway" "this" {[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m allocation_id                      = (known after apply)[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m association_id                     = (known after apply)[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m connectivity_type                  = "public"[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                                 = (known after apply)[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m network_interface_id               = (known after apply)[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m private_ip                         = (known after apply)[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m public_ip                          = (known after apply)[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m secondary_private_ip_address_count = (known after apply)[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m secondary_private_ip_addresses     = (known after apply)[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m subnet_id                          = (known after apply)[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                               = {[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.929[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-eu-west-1a"[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all                           = {[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-eu-west-1a"[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_route.private_nat_gateway[0][0m will be created[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route" "private_nat_gateway" {[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m destination_cidr_block = "0.0.0.0/0"[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                     = (known after apply)[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m instance_id            = (known after apply)[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m instance_owner_id      = (known after apply)[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m nat_gateway_id         = (known after apply)[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m network_interface_id   = (known after apply)[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m origin                 = (known after apply)[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route_table_id         = (known after apply)[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m state                  = (known after apply)[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m timeouts {[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m create = "5m"[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_route.public_internet_gateway[0][0m will be created[0m
[0;90m03:37:05.930[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route" "public_internet_gateway" {[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m destination_cidr_block = "0.0.0.0/0"[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m gateway_id             = (known after apply)[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                     = (known after apply)[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m instance_id            = (known after apply)[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m instance_owner_id      = (known after apply)[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m network_interface_id   = (known after apply)[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m origin                 = (known after apply)[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route_table_id         = (known after apply)[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m state                  = (known after apply)[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m timeouts {[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m create = "5m"[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_route_table.private[0][0m will be created[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table" "private" {[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn              = (known after apply)[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id               = (known after apply)[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id         = (known after apply)[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m propagating_vgws = (known after apply)[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route            = (known after apply)[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags             = {[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-private"[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all         = {[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.931[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-private"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id           = (known after apply)[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_route_table.public[0][0m will be created[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table" "public" {[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn              = (known after apply)[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id               = (known after apply)[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id         = (known after apply)[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m propagating_vgws = (known after apply)[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route            = (known after apply)[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags             = {[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-public"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all         = {[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-public"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id           = (known after apply)[0m
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.932[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_route_table_association.database[0][0m will be created[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "database" {[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id             = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route_table_id = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m subnet_id      = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_route_table_association.database[1][0m will be created[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "database" {[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id             = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route_table_id = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m subnet_id      = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_route_table_association.database[2][0m will be created[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "database" {[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id             = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route_table_id = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m subnet_id      = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_route_table_association.private[0][0m will be created[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id             = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route_table_id = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m subnet_id      = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_route_table_association.private[1][0m will be created[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id             = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route_table_id = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m subnet_id      = (known after apply)[0m
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.933[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_route_table_association.private[2][0m will be created[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id             = (known after apply)[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route_table_id = (known after apply)[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m subnet_id      = (known after apply)[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_route_table_association.public[0][0m will be created[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id             = (known after apply)[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route_table_id = (known after apply)[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m subnet_id      = (known after apply)[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_route_table_association.public[1][0m will be created[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id             = (known after apply)[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route_table_id = (known after apply)[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m subnet_id      = (known after apply)[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_route_table_association.public[2][0m will be created[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id             = (known after apply)[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m route_table_id = (known after apply)[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m subnet_id      = (known after apply)[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_subnet.database[0][0m will be created[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "database" {[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                                            = (known after apply)[0m
[0;90m03:37:05.934[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m assign_ipv6_address_on_creation                = false[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone                              = "eu-west-1a"[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone_id                           = (known after apply)[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m cidr_block                                     = "10.0.21.0/24"[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_dns64                                   = false[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                                             = (known after apply)[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_native                                    = false[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m map_public_ip_on_launch                        = false[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id                                       = (known after apply)[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                                           = {[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1a"[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all                                       = {[0m
[0;90m03:37:05.935[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1a"[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                                         = (known after apply)[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_subnet.database[1][0m will be created[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "database" {[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                                            = (known after apply)[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m assign_ipv6_address_on_creation                = false[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone                              = "eu-west-1b"[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone_id                           = (known after apply)[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m cidr_block                                     = "10.0.22.0/24"[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_dns64                                   = false[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                                             = (known after apply)[0m
[0;90m03:37:05.936[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_native                                    = false[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m map_public_ip_on_launch                        = false[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id                                       = (known after apply)[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                                           = {[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1b"[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all                                       = {[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1b"[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                                         = (known after apply)[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_subnet.database[2][0m will be created[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "database" {[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                                            = (known after apply)[0m
[0;90m03:37:05.937[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m assign_ipv6_address_on_creation                = false[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone                              = "eu-west-1c"[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone_id                           = (known after apply)[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m cidr_block                                     = "10.0.23.0/24"[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_dns64                                   = false[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                                             = (known after apply)[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_native                                    = false[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m map_public_ip_on_launch                        = false[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id                                       = (known after apply)[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                                           = {[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"        = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1c"[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all                                       = {[0m
[0;90m03:37:05.938[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                = "sbx-dev-eu-west-1-infra-01-vpc-db-eu-west-1c"[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                                         = (known after apply)[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_subnet.private[0][0m will be created[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "private" {[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                                            = (known after apply)[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m assign_ipv6_address_on_creation                = false[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone                              = "eu-west-1a"[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone_id                           = (known after apply)[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m cidr_block                                     = "10.0.1.0/24"[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_dns64                                   = false[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                                             = (known after apply)[0m
[0;90m03:37:05.939[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_native                                    = false[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m map_public_ip_on_launch                        = false[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id                                       = (known after apply)[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                                           = {[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"                     = "dev"[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1a"[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "PrivateSubnet"                   = "true"[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"                      = "true"[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"                           = "true"[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "kubernetes.io/role/internal-elb" = "1"[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all                                       = {[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification"             = "internal"[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"                     = "dev"[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"                      = "terragrunt"[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1a"[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"                    = "genopsx"[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "PrivateSubnet"                   = "true"[0m
[0;90m03:37:05.940[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"                      = "true"[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"                           = "true"[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "kubernetes.io/role/internal-elb" = "1"[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                                         = (known after apply)[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_subnet.private[1][0m will be created[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "private" {[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                                            = (known after apply)[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m assign_ipv6_address_on_creation                = false[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone                              = "eu-west-1b"[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone_id                           = (known after apply)[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m cidr_block                                     = "10.0.2.0/24"[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_dns64                                   = false[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                                             = (known after apply)[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_native                                    = false[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m map_public_ip_on_launch                        = false[0m
[0;90m03:37:05.941[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id                                       = (known after apply)[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                                           = {[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"                     = "dev"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1b"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "PrivateSubnet"                   = "true"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"                      = "true"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"                           = "true"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "kubernetes.io/role/internal-elb" = "1"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all                                       = {[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification"             = "internal"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0mm[0m "Environment"                     = "dev"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"                      = "terragrunt"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1b"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"                    = "genopsx"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "PrivateSubnet"                   = "true"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"                      = "true"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"                           = "true"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "kubernetes.io/role/internal-elb" = "1"[0m
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.942[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                                         = (known after apply)[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_subnet.private[2][0m will be created[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "private" {[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                                            = (known after apply)[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m assign_ipv6_address_on_creation                = false[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone                              = "eu-west-1c"[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone_id                           = (known after apply)[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m cidr_block                                     = "10.0.3.0/24"[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_dns64                                   = false[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                                             = (known after apply)[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_native                                    = false[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m map_public_ip_on_launch                        = false[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id                                       = (known after apply)[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)[0m
[0;90m03:37:05.943[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                                           = {[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"                     = "dev"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1c"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "PrivateSubnet"                   = "true"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"                      = "true"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"                           = "true"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "kubernetes.io/role/internal-elb" = "1"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all                                       = {[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification"             = "internal"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"                     = "dev"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"                      = "terragrunt"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                            = "sbx-dev-eu-west-1-infra-01-vpc-private-eu-west-1c"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"                    = "genopsx"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "PrivateSubnet"                   = "true"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"                      = "true"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"                           = "true"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "kubernetes.io/role/internal-elb" = "1"[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                                         = (known after apply)[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_subnet.public[0][0m will be created[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "public" {[0m
[0;90m03:37:05.944[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                                            = (known after apply)[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m assign_ipv6_address_on_creation                = false[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone                              = "eu-west-1a"[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone_id                           = (known after apply)[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m cidr_block                                     = "10.0.101.0/24"[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_dns64                                   = false[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                                             = (known after apply)[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_native                                    = false[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m map_public_ip_on_launch                        = true[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id                                       = (known after apply)[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                                           = {[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"            = "dev"[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1a"[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "PublicSubnet"           = "true"[0m
[0;90m03:37:05.945[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"             = "true"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"                  = "true"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "kubernetes.io/role/elb" = "1"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all                                       = {[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification"    = "internal"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"            = "dev"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"             = "terragrunt"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1a"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"           = "genopsx"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "PublicSubnet"           = "true"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"             = "true"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"                  = "true"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "kubernetes.io/role/elb" = "1"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                                         = (known after apply)[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_subnet.public[1][0m will be created[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "public" {[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                                            = (known after apply)[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m assign_ipv6_address_on_creation                = false[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone                              = "eu-west-1b"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone_id                           = (known after apply)[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m cidr_block                                     = "10.0.102.0/24"[0m
[0;90m03:37:05.946[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_dns64                                   = false[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                                             = (known after apply)[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_native                                    = false[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m map_public_ip_on_launch                        = true[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id                                       = (known after apply)[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                                           = {[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"            = "dev"[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1b"[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "PublicSubnet"           = "true"[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"             = "true"[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"                  = "true"[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "kubernetes.io/role/elb" = "1"[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all                                       = {[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification"    = "internal"[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"            = "dev"[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"             = "terragrunt"[0m
[0;90m03:37:05.947[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1b"[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"           = "genopsx"[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "PublicSubnet"           = "true"[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"             = "true"[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"                  = "true"[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "kubernetes.io/role/elb" = "1"[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                                         = (known after apply)[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_subnet.public[2][0m will be created[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "public" {[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                                            = (known after apply)[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m assign_ipv6_address_on_creation                = false[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone                              = "eu-west-1c"[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m availability_zone_id                           = (known after apply)[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m cidr_block                                     = "10.0.103.0/24"[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_dns64                                   = false[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                                             = (known after apply)[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)[0m
[0;90m03:37:05.948[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_native                                    = false[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m map_public_ip_on_launch                        = true[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id                                       = (known after apply)[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                                           = {[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"            = "dev"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1c"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "PublicSubnet"           = "true"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"             = "true"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"                  = "true"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "kubernetes.io/role/elb" = "1"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all                                       = {[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification"    = "internal"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"            = "dev"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"             = "terragrunt"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                   = "sbx-dev-eu-west-1-infra-01-vpc-public-eu-west-1c"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"           = "genopsx"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "PublicSubnet"           = "true"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"             = "true"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"                  = "true"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "kubernetes.io/role/elb" = "1"[0m
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.949[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m vpc_id                                         = (known after apply)[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1m  # module.vpc.aws_vpc.this[0][0m will be created[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m  [32m+[0m[0m resource "aws_vpc" "this" {[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m arn                                  = (known after apply)[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m cidr_block                           = "10.0.0.0/16"[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m default_network_acl_id               = (known after apply)[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m default_route_table_id               = (known after apply)[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m default_security_group_id            = (known after apply)[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m dhcp_options_id                      = (known after apply)[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_dns_hostnames                 = true[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_dns_support                   = true[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m id                                   = (known after apply)[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m instance_tenancy                     = "default"[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_association_id                  = (known after apply)[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m main_route_table_id                  = (known after apply)[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m owner_id                             = (known after apply)[0m
[0;90m03:37:05.950[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags                                 = {[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"        = "sbx-dev-eu-west-1-infra-01-vpc"[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"  = "true"[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"       = "true"[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m tags_all                             = {[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Data-classification" = "internal"[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Environment"         = "dev"[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Managed-by"          = "terragrunt"[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Name"                = "sbx-dev-eu-west-1-infra-01-vpc"[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Organization"        = "genopsx"[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "Terragrunt"          = "true"[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          [32m+[0m[0m "infra"               = "true"[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[1mPlan:[0m 35 to add, 0 to change, 0 to destroy.[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m[0m[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  [32m+[0m[0m azs              = [[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m "eu-west-1a",[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m "eu-west-1b",[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m "eu-west-1c",[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    ]
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  [32m+[0m[0m database_subnets = [[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m (known after apply),[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m (known after apply),[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m (known after apply),[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    ]
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  [32m+[0m[0m private_subnets  = [[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m (known after apply),[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m (known after apply),[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m (known after apply),[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    ]
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  [32m+[0m[0m public_subnets   = [[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m (known after apply),[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m (known after apply),[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      [32m+[0m[0m (known after apply),[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    ]
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  [32m+[0m[0m vpc_cidr_block   = "10.0.0.0/16"[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  [32m+[0m[0m vpc_id           = (known after apply)[0m
[0;90m03:37:05.951[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  [32m+[0m[0m vpc_name         = "sbx-dev-eu-west-1-infra-01-vpc"[0m
```
